## Exercises I

In [1]:
import pandas as pd
import numpy as np
from env import get_db_url

from pydataset import data

In [2]:
url = get_db_url("employees")
sql = """
SELECT * FROM employees
"""
em = pd.read_sql(sql, url)
em.shape

(300024, 6)

In [3]:
# All exercises before nÂº 5 are just set up

### 5. Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
# Depending on the error made the message of error changes. Example : NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:mysql.pymsql

# It makes this error for the SQL querry: ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employs' doesn't exist")
#[SQL: SELECT * FROM employs LIMIT 5 OFFSET 50]
#(Background on this error at: https://sqlalche.me/e/14/f405)

### 6. Read the employees and titles tables into two separate DataFrames.
AND
### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [5]:
em.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [6]:
em.shape

(300024, 6)

In [7]:
sql = """
SELECT * FROM titles
"""

titles = pd.read_sql(sql, url)
ttl = titles
ttl.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [8]:
ttl.shape

(443308, 4)

### 8. Display the summary statistics for each DataFrame.

In [9]:
em.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
ttl.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

### 9. How many unique titles are in the titles DataFrame?

In [11]:
len(ttl.title.unique())

7

### 10. What is the oldest date in the to_date column?

In [12]:
ttl.to_date.min()

datetime.date(1985, 3, 1)

### 11. What is the most recent date in the to_date column?

In [13]:
ttl.to_date.max()

datetime.date(9999, 1, 1)

## Exercises II

### 1. Copy the users and roles DataFrames from the examples above.

In [14]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [15]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

### 2. What is the result of using a right join on the DataFrames?

- It will the DataFrames next to each other and according to the comparison made with SQL some data will be lost.

In [16]:
right_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='right', indicator=True)
right_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

### 3. What is the result of using an outer join on the DataFrames?

- Outer joins keep all columns and rows from joined tables

In [17]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [18]:
pd.merge(users, roles, left_on='id', right_on='id', how='outer', indicator=True)
# There is a mismatch between the tables and the data does not reflect the reality on the server. With bigger data, I would get the wrong idea of what is going on under the hood.

   id name_x  role_id     name_y     _merge
0   1    bob      1.0      admin       both
1   2    joe      2.0     author       both
2   3  sally      3.0   reviewer       both
3   4   adam      3.0  commenter       both
4   5   jane      NaN        NaN  left_only
5   6   mike      NaN        NaN  left_only

### 5. Load the mpg dataset from PyDataset.

### 6. Output and read the documentation for the mpg dataset.

### 7. How many rows and columns are in the dataset?

### 8. Check out your column names and perform any cleanup you may want on them.

AND

### 9. Display the summary statistics for the dataset.

In [13]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

- There 234 rows and 11 columns in this dataset

In [10]:
mpg = data('mpg')
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [12]:
mpg = mpg.rename(columns = {'displ':'display', 'cyl':'cylinder', 'trans':'transmission', 'drv':'drive', 'cty': 'city', 'hwy':'highway'}).sample(5)
mpg

,manufacturer,model,display,year,cylinder,transmission,drive,city,highway,fl,class
187,toyota,camry solara,2.2,1999,4,auto(l4),f,21,27,r,compact
151,nissan,pathfinder 4wd,3.3,1999,6,auto(l4),4,14,17,r,suv
111,hyundai,sonata,2.4,2008,4,auto(l4),f,21,30,r,midsize
147,nissan,altima,3.5,2008,6,auto(av),f,19,26,p,midsize
61,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv

In [14]:
mpg.describe()

        display         year  cylinder       city    highway
count  5.000000     5.000000   5.00000   5.000000   5.000000
mean   3.220000  2004.400000   5.60000  17.600000  23.400000
std    0.998499     4.929503   1.67332   3.847077   6.024948
min    2.200000  1999.000000   4.00000  13.000000  17.000000
25%    2.400000  1999.000000   4.00000  14.000000  17.000000
50%    3.300000  2008.000000   6.00000  19.000000  26.000000
75%    3.500000  2008.000000   6.00000  21.000000  27.000000
max    4.700000  2008.000000   8.00000  21.000000  30.000000

### 10. How many different manufacturers are there?

In [15]:
mpg.manufacturer.unique()

array(['toyota', 'nissan', 'hyundai', 'dodge'], dtype=object)

In [16]:
mpg.manufacturer.unique().size

# There is 15 of them

4

### 11. How many different models are there?

In [18]:
mpg.model.unique()

array(['camry solara', 'pathfinder 4wd', 'sonata', 'altima',
       'durango 4wd'], dtype=object)

In [19]:
mpg.model.unique().size
# There is 38 of them

5

### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [20]:
mpg['mileage_difference'] = (mpg.city - mpg.highway)
mpg

,manufacturer,model,display,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference
187,toyota,camry solara,2.2,1999,4,auto(l4),f,21,27,r,compact,-6
151,nissan,pathfinder 4wd,3.3,1999,6,auto(l4),4,14,17,r,suv,-3
111,hyundai,sonata,2.4,2008,4,auto(l4),f,21,30,r,midsize,-9
147,nissan,altima,3.5,2008,6,auto(av),f,19,26,p,midsize,-7
61,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv,-4

### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [53]:
mpg['average_mileage'] = (mpg.city + mpg.highway)/2

mpg.head()

,manufacturer,model,display,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
86,ford,f150 pickup 4wd,4.6,1999,8,manual(m5),4,13,16,r,pickup,-3,14.5,False
53,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,14,19,r,pickup,-5,16.5,True
207,toyota,toyota tacoma 4wd,4.0,2008,6,auto(l5),4,16,20,r,pickup,-4,18.0,True
28,chevrolet,corvette,7.0,2008,8,manual(m6),r,15,24,p,2seater,-9,19.5,False
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,-11,38.5,False

### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [51]:
mpg['is_automatic'] = mpg.transmission.str.contains('auto')

### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [52]:
# Average_mileage mean per manufacturer
mpg.groupby('manufacturer').average_mileage.mean()

manufacturer
chevrolet     19.5
dodge         16.5
ford          14.5
toyota        18.0
volkswagen    38.5
Name: average_mileage, dtype: float64

In [9]:
mpg.groupby(by='manufacturer')['average_mileage'].nlargest(10).sort_values(ascending = False)

KeyError: 'Column not found: average_mileage'

## Exercises III

## 1. Use your get_db_url function to help you explore the data from the c database.

In [33]:
url = get_db_url('chipotle')
sql = """
SELECT * FROM orders
"""
oc = pd.read_sql(sql, url)
oc.shape

(4622, 6)

In [34]:
oc.columns

Index(['id', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [35]:
oc.describe(include='all')

,id,order_id,quantity,item_name,choice_description,item_price
count,4622.000000,4622.000000,4622.000000,4622,4622,4622
unique,NaN,NaN,NaN,50,1044,78
top,NaN,NaN,NaN,Chicken Bowl,nan,$8.75
freq,NaN,NaN,NaN,726,1246,730
mean,2311.500000,927.254868,1.075725,NaN,NaN,NaN
std,1334.400802,528.890796,0.410186,NaN,NaN,NaN
min,1.000000,1.000000,1.000000,NaN,NaN,NaN
25%,1156.250000,477.250000,1.000000,NaN,NaN,NaN
50%,2311.500000,926.000000,1.000000,NaN,NaN,NaN
75%,3466.750000,1393.000000,1.000000,NaN,NaN,NaN
max,4622.000000,1834.000000,15.000000,NaN,NaN,NaN

In [36]:
new_column = {'item_price': 'price', 'item_name': 'item'}

In [37]:
oc = oc.rename(columns = new_column)
oc.head()

,id,order_id,quantity,item,choice_description,price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [38]:
oc.groupby('order_id').sum('price')

             id  quantity
order_id
1            10         4
2             5         2
3            13         2
4            17         2
5            21         2
...         ...       ...
1830       9223         2
1831      13842         3
1832       9233         2
1833       9237         2
1834      13863         3

[1834 rows x 2 columns]

In [39]:
oc.price

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: price, Length: 4622, dtype: object

In [40]:
oc['price'] = oc['price'].astype(float)
oc

ValueError: could not convert string to float: '$2.39 '

## 2. What is the total price for each order?

In [ ]:
sum_price = oc.groupby(['order_id','price']).agg({'order_id': 'count', 'price': 'sum'})
sum_price.sample(10)

## 3. What are the most popular 3 items?

In [ ]:
top_three = oc.groupby('item').quantity.sum().sort_values(ascending = False)

## 4. Which item has produced the most revenue?

## 5. Join the employees and titles DataFrames together.

In [ ]:
em.merge(ttl, left_on='emp_no', right_on='emp_no', how='outer', indicator=True)
merged = em.merge(ttl, left_on='emp_no', right_on='emp_no', how='outer', indicator=True)
merged.sample()

## 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
merged[['emp_no', 'first_name', 'last_name', 'gender', 'hire_date', 'title']].hire_date.max()

In [ ]:
merged.gr.hire_date.max()

## 7. Write the code necessary to create a cross tabulation of the number of titles by department.